In [2]:
import os
import pandas as pd

In [19]:
boston_housing = pd.read_csv(os.path.join('data', 'boston_housing', 'test.csv'))

In [20]:
boston_housing.describe()

                Id  OverallQual    GrLivArea   GarageArea
count   259.000000   259.000000   259.000000   259.000000
mean   1331.000000     6.081081  1548.030888   475.467181
std      74.911058     1.379947   560.911287   219.228602
min    1202.000000     3.000000   630.000000     0.000000
25%    1266.500000     5.000000  1148.000000   336.000000
50%    1331.000000     6.000000  1513.000000   484.000000
75%    1395.500000     7.000000  1844.000000   574.000000
max    1460.000000    10.000000  5642.000000  1418.000000

In [25]:
titanic = pd.read_csv(os.path.join('data', 'titanic', 'test.csv'))

In [26]:
titanic.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [27]:
titanic.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [28]:
titanic.var()

PassengerId    14595.166667
Pclass             0.708690
Age              201.106695
SibSp              0.804178
Parch              0.963203
Fare            3125.657074
dtype: float64